app/controllers/products_controller.rb

SELECT * FROM "products" WHERE ("products".user_id = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def index
    @products = Product.all
    @product_more = Product.price_more_than_100
    @product_less = Product.price_atless_100

    #@user_products = Product.find_all_by_user_id(params[:user_id])
    @user = User.find(params[:user_id])

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("created_at", "title", "image_url", "updated_at", "description") VALUES('2010-04-19 12:34:57', 'ruby on rails ', '/rails.jpg', '2010-04-19 12:34:57', 'use rails to work!')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save